SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( ATSF_8-40CW_837
	Type ( Engine )
	WagonShape ( ATSF_8-40CW_837.s )
	Size ( 3.594m 4.431m 21.62m )
	Comment ( 400,000 lbs ) 
	Mass ( 181.5t )
	WheelRadius ( 40in/2 )
	InertiaTensor ( Box ( 3.594m 4.431m 21.62m ) )
	Coupling (
	Type ( Automatic )
		Spring (
			Stiffness ( 9.8e5N/m 1.76e6N/m )
			Damping ( 1.77e6N/m/s 1.77e6N/m/s )
			Break ( 2.45e7N 1.78e6N )
			r0 ( 0cm 4cm )
			)
		CouplingHasRigidConnection ( 1 )
		Velocity ( 0.1m/s )
		)
	Coupling (
	Type ( Automatic )
		Spring (
			Stiffness ( 9.8e5N/m 1.76e6N/m )
			Damping ( 1.77e6N/m/s 1.77e6N/m/s )
			Break ( 2.45e6N 1.78e6N )
			r0 ( 0cm 4cm )
		)
		CouplingHasRigidConnection ( 1 )
		Velocity ( -0.1m/s )
			)
	Adheasion ( 0.48 0.68 2 0 )
	DerailRailHeight ( 4cm )
	DerailRailForce ( 2.5*181.5t )
	DerailBufferForce ( 545kN )
	Numwheels ( 12 )
	Friction (	
		1930.9N/m/s		-0.10		1.2mph		21.286N/m/s	1.842
		5.1N/rad/s		1		-1rad/s		0		1
	)

	BrakeEquipmentType ( "Triple_valve, Auxilary_reservoir, Emergency_brake_reservoir" )
	BrakeSystemType ( "Air_single_pipe" )

	MaxBrakeForce ( 172.43kN )
	EmergencyBrakeResMaxPressure( 90 )
	TripleValveRatio( 2.5 ) 
	EmergencyResVolumeMultiplier ( 1.461 ) 
	MaxReleaseRate( 0.51 ) 
	MaxApplicationRate( 0.93 ) 
	MaxAuxilaryChargingRate( 0.23 ) 
	EmergencyResCapacity( 2.0631 ) 
	EmergencyResChargingRate( 0.23 ) 
	BrakeCylinderPressureForMaxBrakeBrakeForce( 64 ) 

	IntakePoint ( 3.33 0.4 FuelDiesel )

	Lights (	10 
		Light	(
			comment( Sphere of Lights Bright)
			Type		( 1 )
			Conditions	(
					Headlight ( 3 )
					Unit ( 2 )
					)
			Cycle		( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( 0.0 3.0 5.0 )
					Transition ( 0 )
					Radius ( 279 )
					Angle ( 15.0 )
					)
				)
			)
		Light (			
                  Comment ( Sphere of lights Dim )
			Type		( 1 )
			Conditions	(
					Headlight ( 2 )
					Unit ( 2 )
					)
			Cycle		( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 40FFFFCA )
					Position ( 0.0 3.3 7.0 )
					Transition ( 0 )
					Radius ( 130 )
					Angle ( 15.0 )
					)
				)
			)    
            Light	(
			comment( Nose light Top dim )
			Type		( 0 )
			Conditions	(
					Headlight ( 2 )
					Unit ( 2 )
					)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80FFFFCA )
					Position ( 0.0 3.59 9.855 )
					Transition ( 0 )
					Radius ( 0.8 )
					)
				)
			)
		Light	(
			comment( Nose light Bottom dim )
			Type		( 0 )
			Conditions	(
					Headlight ( 2 )
					Unit ( 2 )
					)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80FFFFCA )
					Position ( 0.0 3.32 9.835 )
					Transition ( 0 )
					Radius ( 0.8 )
					)
				)
			)
            Light	(
			comment( Nose light Top bright )
			Type		( 0 )
			Conditions	(
					Headlight ( 3 )
					Unit ( 2 )
					)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( 0.0 3.59 9.855 )
					Transition ( 0 )
					Radius ( 1.0 )
					)
				)
			)
		Light	(
			comment( Nose light Bottom bright )
			Type		( 0 )
			Conditions	(
					Headlight ( 3 )
					Unit ( 2 )
					)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( 0.0 3.32 9.835 )
					Transition ( 0 )
					Radius ( 1.0 )
					)
				)
			)		
		Light	(
			comment( Right ditch light )
			Type		( 0 )
			Conditions	(
					Headlight ( 3 )
					Unit ( 2 )
					)
			Cycle		( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( -0.78 1.33 10.452 )
					Transition ( 0 )
					Radius ( 1.0 )
					)
				)
			)
		Light	(
			comment( Left ditch light )
			Type		( 0 )
			Conditions	(
					Headlight ( 3 )
					Unit ( 2 )
					)
			Cycle		( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( 0.78 1.33 10.452 )
					Transition ( 0 )
					Radius ( 1.0 )
					)
				)
			)
            Light	(
			comment( Rear light Top bright )
			Type		( 0 )
			Conditions	(
					Headlight ( 3 )
					Unit ( 3 )
					)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( 0.0 4.4 -9.79 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.0 )
					)
				)
			)
		Light	(
			comment( Rear light Bottom bright )
			Type		( 0 )
			Conditions	(
					Headlight ( 3 )
					Unit ( 3 )
					)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( 0.0 4.19 -9.77 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.0 )
					)
				)
			)
		)
	Sound ( "..\\..\\COMMON.SND\\MLW_FDL16\\FDL16_ATSFD8Weng.sms" )
	)

Engine ( ATSF_8-40CW_837
	Effects
	(
		DieselSpecialEffects
		(
		Exhaust1
			(
                        0 4.72 -3.515
				0 1 0
				0.2
			)
		)
	)
	Wagon ( ATSF_8-40CW_837 )
	Type ( Diesel )
	MaxPower ( 2682.6kW ) Comment ( 4135 HP x 87% Eff. )
	MaxForce ( 592.3kN )
	MaxContinuousForce ( 483.7kN )
	MaxVelocity ( 71mph )
	MaxCurrent ( 1800A )
	WheelRadius ( 20in )
	Sanding ( 5mph )
	NumWheels ( 4 )
	MaxTemperature ( 120 )
	MaxOilPressure ( 90 )

	CabView ( GE-C40-8W-GEN.cvf )
      HeadOut ( 1.75 4.0 6.87 )

	AirBrakesAirCompressorPowerRating( 3 )
	AirBrakesMainMinResAirPressure( 14.5 )
	AirBrakesMainMaxAirPressure( 140 )
	AirBrakesMainResVolume( 9 )
	AirBrakesAirCompressorWattage( 19000 )
	AirBrakesCompressorRestartPressure( 135 )
	AirBrakesAirUsedPerPoundsOfBrakePipePressure( 1.4 )
	AirBrakesHasLowPressureTest( 1 )
	AirBrakesIsCompressorElectricOrMechanical( 1 )

	EngineBrakesControllerMinPressureReduction( 6 )
	TrainBrakesControllerMinPressureReduction( 6 )
	EngineBrakesControllerHasProportionalBrake( 1 )
	EngineBrakesProportionalBrakeLag( 0.45 )
	EngineBrakesControllerMaxApplicationRate( 7 )
	TrainBrakesControllerMaxApplicationRate( 4 )
	EngineBrakesControllerMaxReleaseRate( 14.5 )
	TrainBrakesControllerMaxReleaseRate( 4.5 )
	EngineBrakesControllerEmergencyApplicationRate( 8 )
	TrainBrakesControllerEmergencyApplicationRate( 7 )
	EngineBrakesControllerMinSystemPressure( 15 )
	TrainBrakesControllerMinSystemPressure( 15 )
	EngineBrakesControllerMaxSystemPressure( 90 )
	TrainBrakesControllerMaxSystemPressure( 90 )
	EngineBrakesControllerEmergencyBrakeTimePenalty( 60 )
	TrainBrakesControllerEmergencyBrakeTimePenalty( 60 )
	EngineBrakesControllerFullServicePressureDrop( 26 )
	TrainBrakesControllerFullServicePressureDrop( 26 )
	EngineBrakesControllerDirectControlExponent( 1 )

	DynamicBrakesMinUsableSpeed( 4 )
	DynamicBrakesMaximumEffectiveSpeed( 71 )
	DynamicBrakesMaximumForce( 356.5kN )
	DynamicBrakesResistorCurrentLimit ( 805 )
	DynamicBrakesCutInSpeed( 5 )
	DynamicBrakesMaxAirBrakePressure ( 50 )
	DynamicBrakesFadingSpeed( 7 )
	DynamicBrakesDelayTimeBeforeEngaging ( 8 )
	DynamicBrakesMaximumSpeedForFadeOut ( 500 )
	DynamicBrakesEffectAtMaximumFadeOut( 0 )
	DynamicBrakesHigherSpeedCurveExponent( 10.0 )
	DynamicBrakesLowerSpeedCurveExponent( 0.85 )
	DynamicBrakesNumberOfControllerNotches( 1 )
      DynamicBrakeHasAutoBailOff ( 1 )

	BrakesEngineBrakeType ( "Air_single_pipe"  )
	BrakesTrainBrakeType ( "Air_single_pipe" )
      BrakesEngineControllers( "Independent, Train, Dynamic" )
	
	MaxDieselLevel ( 5000gal )
	DieselUsedPerHourAtMaxPower ( 198gal )
	DieselUsedPerHourAtIdle ( 4.3gal )
	DieselSmokeEffectInitialMagnitude( 0.9 )
	DieselSmokeEffectMaxMagnitude( 1.8 )
	DieselSmokeEffectInitialSmokeRate( 0.4 )
	DieselSmokeEffectMaxSmokeRate( 2.5 )
	DieselEngineIdleRPM( 310 )
	DieselEngineMaxRPM( 1050 )
	DieselEngineSpeedOfMaxTractiveEffort( 11.4mph )
	DieselEngineMaxRPMChangeRate( 28 )
	DoesHornTriggerBell( 1 )
	
	EmergencyStopMonitor(
    		MonitoringDeviceMonitorTimeLimit( 0 )
    		MonitoringDeviceAlarmTimeLimit( 0 )
    		MonitoringDevicePenaltyTimeLimit( 0 )
    		MonitoringDeviceCriticalLevel( 0 )
    		MonitoringDeviceResetLevel( 0 )
    		MonitoringDeviceAppliesFullBrake( 0 )
    		MonitoringDeviceAppliesEmergencyBrake( 0 )
    		MonitoringDeviceAppliesCutsPower( 0 )
    		MonitoringDeviceAppliesShutsDownEngine( 0 )
		MonitoringDeviceResetOnZeroSpeed( 0 )
	)
	EngineControllers (
            Throttle ( 0 1 0.125 0 
                NumNotches ( 9
                    Notch ( 0       0 Dummy )
                    Notch ( 0.125   0 Dummy )
                    Notch ( 0.25    0 Dummy )
                    Notch ( 0.375   0 Dummy )
                    Notch ( 0.5     0 Dummy )
                    Notch ( 0.625   0 Dummy )
                    Notch ( 0.75    0 Dummy )
                    Notch ( 0.875   0 Dummy )
                    Notch ( 1       0 Dummy )
                )
            )
            Brake_Engine ( 0 1 0.025 0 
                NumNotches ( 1
                    Notch( 0  	1 Dummy )
                )
            )
            Brake_Train ( 0 1 0.0125 0.5 
                NumNotches ( 5
                    Notch ( 0    	0 TrainBrakesControllerReleaseStart )
                    Notch ( 0.3  	1 TrainBrakesControllerGraduatedSelfLapLimitedHoldingStart )
                    Notch ( 0.85 	0 TrainBrakesControllerSuppressionStart )
                    Notch ( 0.9  	0 TrainBrakesControllerContinuousServiceStart )
                    Notch ( 0.95 	0 TrainBrakesControllerEmergencyStart )
                )
            )
            Brake_Dynamic ( 0 1 0.025 0 
                NumNotches ( 2
                    Notch ( 0      0 Dummy )
                    Notch ( 0.025  1 Dummy )
                 )
            )
		Combined_Control( 0 1 0.5 0.5 throttle dynamic )  
            DirControl ( -1 0 1 1 )
            BellToggle( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            EmergencyStopToggle( 0 1 0 )
            Vigilance ( 0 1 0 )
            Headlights ( 0 0.25 1 0 )
            BailOffButton( 0 1 0 )
            Wipers ( 0 1 0 )
      )
 	Sound ( "..\\..\\COMMON.SND\\MLW_FDL16\\FDL16_ATSFD8Wcab.sms" )

 	Name ( "ATSF 8-40CW 837" )
 	Description (
	"The C40-8W, a modern diesel-electric locomotive, most effective "+
	"pulling loads over long stretches at moderate speeds.\n\n"+
	"Locomotive type: Diesel-Electric\n\n"+
	"Power: 4,135hp\n\n"+
	"Max. speed: 71 mph (115 km/h)\n\n"+
	"Gear ratio: 83:20\n\n"+
	"Power source: GE 7FDL16, Alternator GMG197\n\n"+
      "Traction motors: GE752AH\n\n"+
	"Produced: 1989-1994\n\n"+
	"Max. continuous tractive effort: 108,600 Lbs. (488.7 kN) @11.4mph\n\n"+
	"Wheel configuration: Twelve 40-inch (100.5 cm) diameter in C-C configuration (two sets of three "+
	"driven axles)\n\n"+
	"Height: 15 ft. 6 in. (4.70 m)\n\n"+
	"Width: 10 ft. 3 in. (3.12 m)\n\n"+
	"Length: 70 ft. 8 in. (22.25 m)\n\n"+
	"Weight: 200 U.S. tons (181.5 metric tons)"	
 	)
)